#+SETUPFILE: themes/org-minimal-theme.setup
#+TITLE:  API Endpoints Development / Operations Doc for together-apart Project
#+AUTHOR: Matthew Burns
#+EMAIL: matthewburns@gmail.com
#+DATE: <2018-05-01 Tue>
#+LANGUAGE: en
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./org.css"/>
* Acceptance Criteria
#+BEGIN_SRC sh :results output raw
:curl -X POST -u USER:PASS \
http://matt-burns.shftbrd.com/split?signature=04e74f3b8cfcf0b502ff701a9b5f0b98ece0d3b4 \
-d '{"string":"split me"}'
#+END_SRC

#+BEGIN_SRC sh :results output raw
curl -X POST -u USER:PASS \
http://localhost/split?signature=04e74f3b8cfcf0b502ff701a9b5f0b98ece0d3b4 \
-d '{"string":"split me"}'
#+END_SRC

#+RESULTS:
{"message":{"odd":["s","l","t","m"],"even":["p","i"," ","e"]}}

#+BEGIN_SRC sh :results output raw
curl -X POST -u USER:PASS \
https://localhost/split?signature=04e74f3b8cfcf0b502ff701a9b5f0b98ece0d3b4 \
-d '{"string":"split me"}'
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh
curl -X POST -u USER:PASS \
http://matt-burns.shftbrd.com/join?signature=6edd74450aa9206c4ba0b8c009de382a3e91f404 \
-d '{"odd":["s","l","t","m"], "even":["p","i"," ","e"]}'
#+END_SRC

#+BEGIN_SRC sh :results output raw
curl -X POST -u USER:PASS \
http://localhost/join?signature=6edd74450aa9206c4ba0b8c009de382a3e91f404 \
-d '{"odd":["s","l","t","m"], "even":["p","i"," ","e"]}'
#+END_SRC

#+RESULTS:
{"message":"split me"}

#+BEGIN_SRC sh
curl -X POST -u USER:PASS \
https://localhost:join?signature=6edd74450aa9206c4ba0b8c009de382a3e91f404 \
-d '{"odd":["s","l","t","m"], "even":["p","i"," ","e"]}'
#+END_SRC

#+BEGIN_SRC sh
curl -u USER:PASS http://matt-burns.shftbrd.com/lastResponse
#+END_SRC

#+BEGIN_SRC sh
curl -u USER:PASS http://localhost/lastResponse
#+END_SRC

#+BEGIN_SRC sh
curl -u USER:PASS https://localhost/lastResponse
#+END_SRC


#+BEGIN_SRC sh :results output  html
prove -v -I/../Together-Apart/lib t/acceptance.t
#+END_SRC

#+BEGIN_SRC sh
# Subtest: business unit tests.
    1..3
    ok 1 - Odd and even combined into a single numberical sequence
    ok 2 - Numbers split into two sequences these the odd
    ok 3 - Numbers split into two sequence these are the even
ok 1 - business unit tests.
# Subtest: API usage mocking registered auth. see F1, F2, F3, G0, G1, G2, G3, G4, G5, G6
    1..10
    ok 1 - POST http://TBD:TBD@127.0.0.1:35837/split?signature=%3AjQ%C2%BF%C3%87%16%C3%A3j7%C3%A7%19_V%C2%8A%C3%B7u%27%3Fm%22
    ok 2 - 200 OK
    ok 3 - POST http://TBD:TBD@127.0.0.1:35837/split?signature=%3AjQ%C2%BF%C3%87%16%C3%A3j7%C3%A7%19_V%C2%8A%C3%B7u%27%3Fm%22
    ok 4 - 422 Unprocessable Entity
    ok 5 - POST http://TBD:TBD@127.0.0.1:35837/join?signature=%C2%B6D%C3%85%18%3B5%C3%8E%C2%86%0B%0Ef%C3%8D%04%5C%126%C3%94%05%C2%A5%C3%90
    ok 6 - 200 OK
    ok 7 - POST http://TBD:TBD@127.0.0.1:35837/join?signature=%C2%B6D%C3%85%18%3B5%C3%8E%C2%86%0B%0Ef%C3%8D%04%5C%126%C3%94%05%C2%A5%C3%90
    ok 8 - 422 Unprocessable Entity
    ok 9 - GET http://TBD:TBD@127.0.0.1:35837/lastResponse
    ok 10 - Basic auth check on each endpoint called the mock auth webservice
ok 2 - API usage mocking registered auth. see F1, F2, F3, G0, G1, G2, G3, G4, G5, G6
1..2
ok
All tests successful.
Files=1, Tests=2,  0 wallclock secs ( 0.02 usr  0.00 sys +  0.20 cusr  0.02 csys =  0.24 CPU)
Result: PASS
#+END_SRC
